/*!
@file EffectManager.h
@brief ポーズを管理するManager
*/

#pragma once
#include "stdafx.h"

namespace basecross
{
	class EffectManager
	{
	//--------------------------------------------------------------------------------------
	// メンバ変数
	//--------------------------------------------------------------------------------------
	private:
		ManagerRef m_manager;
		RendererRef m_renderer;
		map<wstring, EffectRef> m_effectList;
		bool m_isCreateEffectManager = false;
	//--------------------------------------------------------------------------------------
	// メンバ関数
	//--------------------------------------------------------------------------------------
	private:
		//----------------------------------------------------------------------------------
		/*
			コンストラクタ
		*/
		EffectManager() {}
		//----------------------------------------------------------------------------------
		/*
			デストラクタ
		*/
		virtual ~EffectManager()
		{
			Release();
		}
	public:
		//----------------------------------------------------------------------------------
		/*
			インスタンス
		*/
		static EffectManager& Instance();
		//----------------------------------------------------------------------------------
		/*
			Effekseerのインターフェース設定
			@param なし
			@return なし
		*/
		void CreateEfkInterface();
		//----------------------------------------------------------------------------------
		/*
			エフェクトの更新処理
			@param なし
			@return なし
		*/
		void InterfaceUpdate();
		//----------------------------------------------------------------------------------
		/*
			エフェクトの描画処理
			@param なし
			@return なし
		*/
		void InterfaceDraw();
		//----------------------------------------------------------------------------------
		/*
			ビューと射影行列を設定する
			@param view	ビュー行列
			@param proj	射影行列
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void SetViewProj(const Mat4x4& view, const Mat4x4& proj);
		//----------------------------------------------------------------------------------
		/*
			エフェクトを登録する
			@param EfkKey エフェクトの登録キーネーム
			@param EfkFilePash エフェクトのファイルパス
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void RegisterEffect(const wstring EfkKey, const wstring EfkFilePash);
		//----------------------------------------------------------------------------------
		/*
			エフェクトを再生する
			@param EfkKey 再生したいエフェクトのキー
			@param Emitter 再生位置
			@param StartFreme 開始フレーム
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		Handle PlayEffect(const wstring EfkKey, const Vec3 Emitter, const float StartFreme = 0.0f);
		//----------------------------------------------------------------------------------
		/*
			エフェクトの位置に加算する
			@param EfkHandle エフェクトのハンドル
			@param Position 加算する値 
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void AddPosition(const Handle& EfkHandle, const Vec3 Position);
		//----------------------------------------------------------------------------------
		/*
			エフェクトの位置を指定する
			@param EfkHandle エフェクトのハンドル
			@param Position 指定する値 
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void SetPosition(const Handle& EfkHandle, const Vec3 Position);
		//----------------------------------------------------------------------------------
		/*
			エフェクトをオイラー角による回転で設定する
			@param EfkHandle エフェクトのハンドル
			@param EulerAngles オイラー角
			@return	なし
		*/
		void SetRotationFromEulerAngles(const Handle& EfkHandle, const Vec3 EulerAngles);
		//----------------------------------------------------------------------------------
		/*
			エフェクトをクォータニオンによる回転で設定する
			@param EfkHandle エフェクトのハンドル
			@param Quaternion クォータニオンの値
			@return	なし
		*/
		void SetRotationFromQuaternion(const Handle& EfkHandle, const Quat Quaternion);
		//----------------------------------------------------------------------------------
		/*
			エフェクトを軸と角度による回転で設定する
			@param EfkHandle エフェクトのハンドル
			@param AxisVec 軸（方向ベクトル）
			@param Angle 角度
			@return	なし
		*/
		void SetRotationFromAxisAngle(const Handle& EfkHandle, const Vec3 Axis, const float Angle);
		//----------------------------------------------------------------------------------
		/*
			エフェクトの拡大率を指定する。
			@param EfkHandle エフェクトのハンドル
			@param Scale 拡大する値
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void SetScale(const Handle& EfkHandle, const Vec3 Scale);
		//----------------------------------------------------------------------------------
		/*
			エフェクトの全体の色を指定する
			@param EfkHandle エフェクトのハンドル
			@param Col 色の値
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void SetAllColor(const Handle& EfkHandle, const Col4 Col);
		//----------------------------------------------------------------------------------
		/*
			全てのエフェクトをポーズ状態にする
			@param pause on/off
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void PauseAllEffects (const bool pause);
		//----------------------------------------------------------------------------------
		/*
			エフェクトの再生を止める
			@param EfkHandle エフェクトのハンドル
			@return	なし
		*/
		//----------------------------------------------------------------------------------
		void StopEffect(const Handle& EfkHandle);
		//----------------------------------------------------------------------------------
		/*
			エフェクトのインスタンスを再生スピードを設定する。
			@param	handle	インスタンスのハンドル
			@param	speed	スピード
			@retrun なし
		*/
		//----------------------------------------------------------------------------------
		void SetSpeed(const Handle& EfkHandle, const float Speed);
		//----------------------------------------------------------------------------------
		/*
			エフェクトのNull値を取得
			@param なし
			@return	effNull 値は-10000
		*/
		//----------------------------------------------------------------------------------
		Handle GetEffNull();
		//----------------------------------------------------------------------------------
		/*
			エフェクトのインスタンスを削除する
			@retrun なし
		*/
		//----------------------------------------------------------------------------------
		void Release();

		int32_t GetTotalInstanceCount();
	};
}